Endsem/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 305;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }

    topAndBottom_wall
    {
        type            zeroGradient;
    }

    hot_wall
    {
        type            fixedValue;
        value           uniform 311;
    }

    cold_wall
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    inner_wall
    {
    	type            fixedValue;
        value           uniform 305;
    }
}


// ************************************************************************* //
